MatPhys/matphys_sem1.org
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage{esint}
#+LATEX_HEADER:\usepackage[english,russian]{babel}
#+LATEX_HEADER:\usepackage{mathtools}
#+LATEX_HEADER:\usepackage{amsthm}
#+OPTIONS: toc:nil
#+LATEX_HEADER:\usepackage[top=0.8in, bottom=0.75in, left=0.625in, right=0.625in]{geometry}

#+LATEX_HEADER:\def\zall{\setcounter{lem}{0}\setcounter{cnsqnc}{0}\setcounter{th}{0}\setcounter{Cmt}{0}\setcounter{equation}{0}}

#+LATEX_HEADER:\newcounter{lem}\setcounter{lem}{0}
#+LATEX_HEADER:\def\lm{\par\smallskip\refstepcounter{lem}\textbf{\arabic{lem}}}
#+LATEX_HEADER:\newtheorem*{Lemma}{Лемма \lm}

#+LATEX_HEADER:\newcounter{th}\setcounter{th}{0}
#+LATEX_HEADER:\def\th{\par\smallskip\refstepcounter{th}\textbf{\arabic{th}}}
#+LATEX_HEADER:\newtheorem*{Theorem}{Теорема \th}

#+LATEX_HEADER:\newcounter{cnsqnc}\setcounter{cnsqnc}{0}
#+LATEX_HEADER:\def\cnsqnc{\par\smallskip\refstepcounter{cnsqnc}\textbf{\arabic{cnsqnc}}}
#+LATEX_HEADER:\newtheorem*{Consequence}{Следствие \cnsqnc}

#+LATEX_HEADER:\newcounter{Cmt}\setcounter{Cmt}{0}
#+LATEX_HEADER:\def\cmt{\par\smallskip\refstepcounter{Cmt}\textbf{\arabic{Cmt}}}
#+LATEX_HEADER:\newtheorem*{Note}{Замечание \cmt}

\zall

Захаров, Дмитриев, Орлик "Уравнения математической физики".
6 вопросов, 3 теории, 3 задачи

* Семинар 1
** Уравнения в частных производных второго порядка
 #+BEGIN_EXPORT latex
 Это уравнения вида
 \begin{equation}
 a_{11}(x, y)u_{xx} + 2a_{12}(x, y)u_{xy} + a_{22}u_{yy} + f(x, y, u, u_x, u_y) = 0
 \end{equation}
 #+END_EXPORT
 Делаем замену
 #+BEGIN_EXPORT latex
 \begin{equation*}
 \begin{cases}
 u(x, y) = v(\xi, \eta), \\
 \xi = \xi(x, y), \\
 \eta = \eta(x, y).
 \end{cases}
 \end{equation*}
 #+END_EXPORT
 Тогда уравнение приводится к виду
 #+BEGIN_EXPORT latex
 \begin{equation*}
 \overline{a_{11}}v_{\xi\xi} + 2\overline{a_{12}}v_{\xi\eta} + \overline{a_{22}}v_{\eta\eta} + f = 0
 \end{equation*}
 #+END_EXPORT
 Характеристическое уравнение:
 #+BEGIN_EXPORT latex
 \begin{equation}
 a_{11}(dy)^2 - 2a_{12}dxdy + a_{22}(dx)^2 = 0
 \end{equation}
 Дискриминант:
 \begin{equation*}
 D = (a_{12})^2 - a_{11}a_{22}
 \end{equation*}
 #+END_EXPORT
 D > 0 - гиперболический тип, D < 0 - эллиптический, D = 0 - параболический.
 #+BEGIN_EXPORT latex
 \begin{equation}
 \begin{cases}
 u_{xx} = v_{\xi\xi}\xi_x^2 + 2v_{\xi\eta}\xi_x\eta_x + v_{\eta\eta}\eta_x^2 + v_{\xi}\xi_{xx} + v_{\eta}\eta_{xx}, \\
 u_{yy} = v_{\xi\xi}\xi_y^2 + 2v_{\xi\eta}\xi_y\eta_y + v_{\eta\eta}\eta_y^2 + v_{\xi}\xi_{yy} + v_{\eta}\eta_{yy}, \\
 u_{xy} = v_{\xi\xi}\xi_x\xi_y + v_{\xi\eta}(\xi_x\eta_y + \xi_y\eta_x) + v_{\eta\eta}\eta_x\eta_y
 + v_{\xi}\xi_{xy} + v_{\eta}\eta_{xy}
 \end{cases}
 \end{equation}
 \begin{equation*}
 \begin{cases}
 \alpha = \xi + \eta, \\
 \beta = \xi - \eta.
 \end{cases}
 \end{equation*}
 #+END_EXPORT
** Задача 6
 #+BEGIN_EXPORT latex
 \begin{equation}
 u_{xx} + yu_{yy} = 0
 \end{equation}
 Характеристическое уравнение:
 \begin{equation}
 (dy)^2 + y(dx)^2 = 0
 \end{equation}
 #+END_EXPORT
 Первый случай:
 $y < 0 \Rightarrow D = -y > 0$, откуда уравнение гиперболического типа.
 #+BEGIN_EXPORT latex
 \begin{equation*}
 \frac{dy}{dx} = \pm\sqrt{-y} \Rightarrow \frac{dy}{\sqrt{-y}} = dx
 \end{equation*}
 \begin{equation*}
 \int{\frac{dy}{\sqrt{-y}}} = -\int{(-y)^{-\frac12}}d(-y) = -2\sqrt{-y}
 \end{equation*}
 Откуда
 \begin{equation*}
 -2\sqrt{-y} = x + C
 \end{equation*}
 И, соответственно
 \begin{equation*}
 \begin{cases}
 \xi = x + 2\sqrt{-y}, \\
 \eta = -x + 2\sqrt{-y}.
 \end{cases}
 \end{equation*}
 Найдём $u_{xx}$ и $u_{yy}$:
 \begin{equation*}
 \begin{cases}
 \xi_{yy} = \frac12\frac{-1}{(-y)^{\frac32}}, \\
 \eta_{yy} = \frac12\frac{-1}{(-y)^{\frac32}}.
 \end{cases}
 \end{equation*}
 \begin{equation*}
 \begin{cases}
 u_{xx} = v_{\xi\xi}*1^2 + 2v_{\xi\eta}*1*(-1) + v_{\eta\eta}*1 + v_{\xi}\frac12\frac{-1}{(-y)^{\frac32}}
 + v_{\eta}\frac12\frac{-1}{(-y)^{\frac32}}, \\
 u_{yy} = -\frac1yv_{\xi\xi} + 2v_{\xi\eta}\left(-\frac1y\right) + v_{\eta\eta}\left(-\frac1y\right)
 + v_{\xi} + v_{\eta}.
 \end{cases}
 \end{equation*}
 Подставляя найденные значения в исходное уравнение, получаем:
 \begin{equation}
 2v_{\xi\eta} + \frac1{\xi + \eta}(v_{\xi} + v_{\eta}) = 0
 \end{equation}
 #+END_EXPORT
 Второй случай: $y > 0 \Rightarrow D = -y < 0 \Rightarrow \frac{dy}{dx} = \pm i\sqrt{y}$,
 т. е. уравнение эллиптического типа.
 #+BEGIN_EXPORT latex
 \begin{equation*}
 \frac{dy}{\sqrt{y}} = \pm idx \Rightarrow 2\sqrt{y} = \pm ix + C
 \end{equation*}
 Откуда
 \begin{equation*}
 \begin{cases}
 \xi = x, \\
 \eta = 2\sqrt{y}, \\
 \xi_x = 1, \\
 \eta_y = \frac1{\sqrt{y}}
 \eta_{yy} = -\frac12\frac1{y^{\frac32}}.
 \end{cases}
 \end{equation*}
 Подставляя вторые производные в исходное уравнение, получаем первую каноническую форму:
 \begin{equation}
 v_{\xi\xi} + y\left(v_{\eta\eta}\frac1y + \eta_n\left(-\frac12\right)\frac1{y^{\frac32}}\right) = 0.
 \end{equation}
 #+END_EXPORT
 Третий случай: $y = 0$ - параболический вид. Выберем $\xi$ и $\eta$:
 #+BEGIN_EXPORT latex
 \begin{equation*}
 \begin{cases}
 \xi = y, \\
 \eta = x, \\
 \xi_y = 1, \\
 \eta_x = 1.
 \end{cases}
 \end{equation*}
 Подставив в исходное уравнение, получим первую каноническую форму:
 \begin{equation}
 v_{\eta\eta} = 0.
 \end{equation}
 #+END_EXPORT
** Задача 6\10
 #+BEGIN_EXPORT latex
 \begin{equation}
 y^2u_{xx} - x^2u_{yy} = 0.
 \end{equation}
 Характеристическое уравнение:
 \begin{equation}
 y^2(dy)^2 - x^2(dx)^2 = 0 \Rightarrow ydx = \pm xdx \Rightarrow D = x^2y^2
 \end{equation}
 Если $x \neq 0$ и $y \neq 0$, то получим $x^2 + y^2 = C$, откуда
 \begin{equation}
 \begin{cases}
 \xi = y^2 + x^2, \\
 \eta = y^2 - x^2,
 \end{cases}
 \end{equation}
 что даёт
 \begin{equation}
 \begin{cases}
 \alpha = y^2, \\
 \beta = x^2.
 \end{cases}
 \end{equation}
 После замены получим:
 \begin{equation}
 y^2(v_{\beta\beta}*4x^2 + 2v_{\beta}) - x^2(v_{\alpha\alpha}*4y^2 + 2v_{\alpha}) = 0
 \end{equation}
 Откуда
 \begin{equation}
 v_{\beta}2y^2 - 2v_{\alpha}x^2 = 0
 \end{equation}
 Случай y = 0:
 \begin{equation}
 y = x = 0, u_{yy} = u_{xx} = 0, v_{\beta\beta} - v_{\alpha\alpha} + \frac{v_{\beta}}{2\alpha} + \frac{v_{\alpha}}{2\alpha} = 0
 \end{equation}
 #+END_EXPORT
** Задача 15
 #+BEGIN_EXPORT latex
 \begin{equation}
 x^2u_{xx} + 2xyu_{xy} + y^2u_{yy} = 0.
 \end{equation}
 Характеристическое уравнение:
 \begin{equation}
 x^2(dy^2) - 2xydxdy + y^2(dx)^2 = (xdy - ydx)^2 = 0
 \end{equation}
 Тогда $xdy = ydx \Rightarrow \frac{y}x = C$, откуда
 \begin{equation}
 \begin{cases}
 \xi = \frac{y}x, \\
 \eta = x, \\
 \xi_x = -\frac{y}{x^2}, \\
 \xi_{xx} = \frac{2y}{x^3}, \\
 \xi_{yy} = \frac1x, \\
 \xi_{xy} = -\frac1{x^2}, \\
 \eta_x = 1.
 \end{cases}
 \end{equation}
 Подставив это в (1), получим:
 \begin{equation}
 x^2\left(v_{\xi\xi}\left(\frac{2y}{x^3}\right)^2 - 2v_{\xi\eta}\frac{y}{x^2} + v_{\eta\eta} + v_{\eta}\frac{2y}{x^3}\right) +
 2xy\left(v_{\xi\xi}\frac1x\left(-\frac{y}x^2\right) + v_{\xi\eta}\frac1x + v_{\eta}\left(-\frac1{x^2}\right)\right) +
 y^2v_{\xi\xi}\frac1{x^2} = 0
 \end{equation}
 После преобразований останется:
 \begin{equation}
 v_{\eta\eta} = 0
 \end{equation}
 #+END_EXPORT
** Задача 24
 #+BEGIN_EXPORT latex
 \begin{equation}
 u_{xx} - 2u_{xy} + u_{yy} + 6u_x - 2u_y + u = 0.
 \end{equation}
 Характеристическое уравнение
 \begin{equation}
 (dy)^2 + 2dxdy + (dy)^2 = 0
 \end{equation}
 Дискриминант равен нулю $\Rightarrow$ уравнение параболического типа.
 \begin{equation}
 \begin{cases}
 \xi = y + x, \\
 \eta = x, \\
 \xi_x = 1, \\
 \xi_y = 1, \\
 \eta_x = 1, \\
 \end{cases}
 \end{equation}

 После подстановки:
 \begin{equation}
 v_{\xi\xi} + 2v_{\xi\eta} + v_{\eta\eta} - 2(v_{\xi\xi} + v_{\xi\eta}) + v_{\xi\xi} + 6u_{\xi} + 6u_{\eta}
 - 2u_{\xi} + u = 0.
 \end{equation}
 Откуда
 \begin{equation}
 u_{\eta\eta} + 4u_{\xi} + 6u_{\eta} + u = 0.
 \end{equation}
 #+END_EXPORT
 Д. з.: 1.11, 1.14, 1.8, 1.19, 1.23
 Начало в 12:15
* Семинар 2
