MatPhys/matphys_sem1.tex
\section{Семинар 2}
\label{sec:org79caa18}
\subsection{Уравнение теплопроводности}
\label{sec:orgdc0a124}
\begin{equation}
u_t = a^2u_{xx} - b(u - u_{avg}) + f(x, t), 0 < x < C
\end{equation}
А также граничные/краевые условия.

Первого рода:
\begin{equation}
u(x, 0) = \varphi(x)
\end{equation}
Второго рода:
\begin{equation}
u_x(0, t) = \nu_1(t)
\end{equation}
\subsection{Задача 2.5}
\label{sec:org00bb4d8}
\begin{equation}
a^2 = 1, u_t = u_{xx}.
\end{equation}
$U(x, t)$ - решение.
$U_1(x, t) = U(x - c, t)$ - решение?
$$U_{1t}(x, t) = U_t(x - c, t), U_{1xx} = U_{xx}(x - c, t)$$
Т. е. решение.
$$U_2(x, t) = U(x, t - c)$$
$$U_{2t}(x, t) = U_t(x, t - c), U_{1xx} = U_{xx}(x, t - c)$$
Т. е. решение.
$$U_3(x, t) = U(cx, c^2t)$$
$$U_{3t}(x, t) = U_t(cx, c^2t)\cdot c^2$$
$$U_{3xx}(x, t) = U_{xx}(cx, c^2t)\cdot c^2$$
Т. е. решение.
$$U_4(x, t) = e^{-cx + c^2t}U(x - 2ct, t)$$
$$U_{4t}(x, t) = e^{-cx+c^2t}c^2U(x - 2ct, t) + e^{-cx + c^2t}(U_x(x - 2ct, t)(-2c) + U_t(x - 2ct, t))$$
$$U_{4xx}(x, t) = e^{-cx + c^2t}(-c)^2U(x - 2ct, t) + e^{-cx + cx^2}(-c)U_x(x - 2ct, t) + e^{-cx + cx^2}U_{xx}(x - 2ct, t)$$
\subsection{Задача 2.10}
\label{sec:org7d7adeb}
\begin{equation*}
0 \leq l \leq x, u_1 = \text{const}, u_2 = \text{const}
\end{equation*}
Задача:
\begin{equation}
\begin{cases}
u_t = a^2u_{xx}, \\
u(0, t) = u_1, \\
u(l, t) = u_2, \\
u(x, 0) = u_0x.
\end{cases}
\end{equation}
\subsection{Задача 2.11}
\label{sec:orgf79cc31}
\begin{equation}
\begin{cases}
u_t = a^2u_{xx} - b(u - u_{out}), \\
u_x(0, t) = 0, \\
u(l, t) = u_{out}, \\
u(x, 0) = u_0.
\end{cases}
\end{equation}
\subsection{Задача 2.12}
\label{sec:orgbc14475}
\begin{equation}
\begin{cases}
u_t = a^2u_{xx}, \\
u_x(0, t) = -\frac{Q}{kS}, \\
u_x(l, t) = -\frac{Q}{kS}, \\
u(x, 0) = 0.
\end{cases}
\end{equation}
\subsection{Задача 2.17(2)}
\label{sec:orgfcf28d2}
\begin{equation}
\begin{cases}
u_t = a^2u_{xx}, \\
u(0, t) = \mu_1(t), \\
u(l, t) = \mu_2(t), \\
u(x, 0) = \varphi(x).
\end{cases}
\end{equation}
Ищем решение в виде:
$$u(x, t) = U(x, t) + v(x, t)$$
где $U(x, t) = a(t)x + b(t)$. Подставив в (33), получим:
\begin{equation}
\begin{cases}
b(t) = \mu_1, \\
a(t)l + b(t) = \mu_2.
\end{cases}
\end{equation}
Откуда $a(t) = \frac{\mu_1 - \mu_2}l$.

Теперь рассмотрим другие краевые условия:
\begin{equation}
\begin{cases}
u(0, t) = \mu_1, \\
u_x(l, t) = \nu_2.
\end{cases}
\end{equation}
Воспользуемся той же заменой:
\begin{equation}
\begin{cases}
b(t) = \mu_1, \\
a(t) = \nu_2.
\end{cases}
\end{equation}
Третий вариант:
\begin{equation}
\begin{cases}
u_x(0, t) = \nu_1, \\
u_x(l, t) = \nu_2.
\end{cases}
\end{equation}
Ищем $U(x, t)$ в виде $U(x, t) = a(t)x^2 + b(t)x$:
\begin{equation}
\begin{cases}
b(t) = \nu_1, \\
2Ca(t) = b(t) = \nu_2.
\end{cases}
\end{equation}
Откуда $a(t) = \frac{\nu_2 - \nu_1}{2C}$.
\subsection{Задача 3.1}
\label{sec:orge0152ed}
Решить задачу
\begin{equation}
\begin{cases}
u_t = a^2u_{xx}, 0 < x < l, t > 0, \\
u(0, t) = 0, u(l, t) = 0, t > 0, \\
u(x, 0) = \varphi(x), 0 \leq x \leq l.
\end{cases}
\end{equation}
Ищем $u(x, t)$ в виде $u(x, t) = X(x)T(t)$. Тогда:
\begin{equation}
XT' = a^2X''T \Rightarrow \frac{X''}X = \frac{T'}{a^2T} = -\lambda.
\end{equation}
Получили два уравнения
\begin{equation}
\begin{cases}
X'' + \lambda X = 0, X(0) = X(l) = 0, \\
T' + \lambda a^2T = 0.
\end{cases}
\end{equation}
Характеристическое уравнение первой задачи:
\begin{equation}
k^2 + \lambda = 0.
\end{equation}
Возможны три случая:

1. $\lambda > 0 \Rightarrow X = C_1\cos\sqrt{\lambda}x + C_2\sin\sqrt{\lambda}x, C_1 = 0, C_2\sin\sqrt{\lambda}l = 0 \Rightarrow \lambda = \left(\frac{\pi n}l\right)^2, n \in \mathbb{Z}$.
Тогда $X_n = \sin\left(\frac{\pi n}l\right)^2x$.

2. $\lambda = 0 \Rightarrow X'' = 0 \Rightarrow X = C_1x + C_2, C_2 = 0, C_1l = 0 \Rightarrow$ решений нет.

3. $\lambda < 0 \Rightarrow k = \pm \sqrt{-\lambda} \Rightarrow X = C_1e^{\sqrt{-\lambda}x} + C_2e^{-\sqrt{-\lambda}}x, C_1 + C_2 = 0, C_1(e^{\sqrt{-\lambda}l} + e^{-\sqrt{-\lambda}l}) = 0 \Rightarrow C_1 = 0$ и решений нет.

Решим теперь второе уравнение. Его решением будет $T(t) = Ce^{-\lambda a^2t} = Ce^{-\left(\frac{\pi n a}l\right)^2t}$.

Общее решение будем искать в виде ряда
$$u = \sum_{n = 1}^{\infty} C_ne^{-\left(\frac{\pi na}l\right)^2}\sin\frac{\pi n}lx.$$
Для нахождения коэффициентов $C_n$ воспользуемся граничным условием:
\begin{equation}
u(x, 0) = \varphi(x) = \sum_{n = 1}^{\infty}C_n\cdot1\cdot\sin\frac{\pi n}lx\text{, где } C_n = \frac2l\int_{0}^l\varphi(\xi)\sin\frac{\pi n}l\xi d\xi
\end{equation}
Решим задачу (33) на отрезке $[0, \pi]$ с начальным условием $u(x, 0) = \sin 3x + 8\sin 5x$.
В этих условиях
$$\lambda_n = n^2, x_n = \sin nx, u = \sum_{n = 1}^{\infty}C_n\sin nxe^{-n^2a^2t}$$
$$\sin 3x + 8\sin 5x = \sum_{n = 1}^{\infty}C_n\sin nx$$
Получили решение:
$$u = e^{-9a^2t}\sin3x + 8e^{-25a^2t^2}\sin 5x$$
\subsection{Задача 3.2}
\label{sec:org3110c4e}
\begin{equation}
\begin{cases}
u_t = \frac14u_{xx} + 1 - x, 0 \leq x \leq 1, t > 0, \\
u(0, t) = t, \\
u(1, t) = 0, \\
u(x, 0) = 3\sin(2\pi x).
\end{cases}
\end{equation}
Ищем решение в виде $u = U + v$, где $U = a(t)x + b(t)$. Тогда:
\begin{equation}
\begin{cases}
b(t) = t, \\
a(t) + b(t) = 0 \Rightarrow a(t) = -t.
\end{cases}
\end{equation}
Получили что $U = -tx + t$. Запишем уравнение для $v$:
\begin{equation}
-x + 1 + v_t = \frac14v_{xx} + 1 - x, \\
v(0, t) = 0, \\
v(l, t) = 0, \\
v(x, 0) = 3\sin(2\pi x).
\end{equation}
Из предыдущей задачи
\begin{equation}
v = \sum_{n = 1}^{\infty}C_ne^{-\frac14(\pi n)^2t}\sin(\pi nx).
\end{equation}
Подставим в начальное условие:
\begin{equation}
3\sin(2\pi x) = \sum_{n = 1}^{\infty}c_n\sin(\pi nx).
\end{equation}
Тогда $u = -tx + t + 3\sin(2\pi x)e^{-\pi^2 t}$.
\subsection{Задача 3.3}
\label{sec:org9984c8b}
\begin{equation}
\begin{cases}
u_t = 4u_{xx} + 2t, x \in (0, \pi), \\
u(x, 0) = \frac{1 + \pi}{\pi}x - 1, \\
u(0, t) = t^2 - 1, \\
u(l, t) = t^2.
\end{cases}
\end{equation}
Ищем $u$ в виде $u = U + v$, где $U = a(t)x + b(t)$. Тогда
\begin{equation}
\begin{cases}
b(t) = t^2 - 1, \\
a(t)\pi + t^2 - 1 = t^2 \Rightarrow a(t) = \frac1{\pi}.
\end{cases}
\end{equation}
Подставив это в исходное уравнение, получм:
\begin{equation}
\begin{cases}
v_t = 4v_{xx}, \\
v(0, t) = 0, \\
v(\pi, t) = 0, \\
v(x, 0) = x.
\end{cases}
\end{equation}
Собственные значения $\lambda_n = n^2, X_n = \sin(nx), v = \sum_{n = 1}^{\infty}C_ne^{-4n^2t}\sin nx$.
Подставляя в начальное условие, получим:
$$v(x, 0) = x = \sum_{n = 1}^{\infty}C_n\sin (nx)$$
\begin{equation}
C_n = \frac2{\pi}\int_0^{\pi}\xi\sin(n\xi)d\xi = \frac2{\pi}\left(-\frac1n\int_0^{\pi}\xi d(\cos\xi)\right) =
-\frac2{\pi n}\left(\xi(\cos n\xi)\right)\bigg|_0^{\pi} - \int_0^{\pi}\cos(n\xi)d\xi = -\frac2n(-1)^n.
\end{equation}
Тогда
\begin{equation}
u = \frac{x}\pi + t^2 - 1 + \sum_{n = 1}^{\infty}\left(-\frac2n(-1)^n\right)e^{4n^2t}\sin(nx).
\end{equation}
Д. з. 2.5, 13, 14, 15, 16, 18, 19, 3.3, 3.4

\section{Семинар 3}
\label{sec:org7972887}
Собственные значения и собственные функции ЗШЛ с разными краевыми условиями:\\
\begin{equation}
\begin{tabular}{ |c|c|c| }
type    & $\lambda_n$                              & $X_n$ \\
I - I   & $\left(\frac{\pi n}{l}\right)^2$         & $\sin\frac{\pi n}lx$ \\
I - II  & $\left(\frac{\pi(2n + 1)}{2l}\right)^2$  & $\sin\frac{\pi(2n + 1)}{2l}$ \\
II - I  & $\left(\frac{\pi(2n + 1)}{2l}\right)^2$  & $\cos\frac{\pi(2n + 1)}{2l}$ \\
II - II & $\left(\frac{\pi n}l\right)^2$           & $\cos\frac{\pi n}lx$.
\end{tabular}
\end{equation}
