MatPhys/matphys_sem1.tex
\subsection{Задача 3.5}
\label{sec:org92740f9}
\begin{equation}
\begin{cases}
u_t = u_{xx}, 0 < x < 1, t > 0, \\
u_x(0, t) = u(l, t) = 0, \\
u(x, 0) = x^2 - 1, 0 \leq x \leq 1.
\end{cases}
\end{equation}
Ищем решение в виде $u(x, t) = X(x)T(t)$. Получим две задачи:
\begin{equation}
\frac{X''}X = \frac{T'}{T} = -\lambda
\end{equation}
Или
\begin{equation}
\begin{cases}
X'' + \lambda X = 0, \\
X'(0) = X(1) = 0, \\
T' + \lambda T = 0.
\end{cases}
\end{equation}
Собственные значения:
\begin{equation}
\lambda_n = \left(\frac{\pi(2n + 1)}{2l}\right)^2,
\end{equation}
\begin{equation}
X_n = \cos\frac{\pi(2n + 1)}{2l}x
\end{equation}
Для $T_n$ получаем:
\begin{equation}
T = Ce^{-\lambda t}.
\end{equation}
Ищем общее решение в виде ряда:
\begin{equation}
u(x, t) = \sum_{n = 1}^{\infty}C_ne^{-\lambda_n t}\cos\frac{\pi(2n + 1)}{2l}x
\end{equation}
Чтобы найти $C_n$, разложим правую часть краевого условия в ряд Фурье:
\begin{equation}
x^2 - 1 = \sum_{n = 0}^{\infty}C_n\cos\frac{\pi(2n + 1)}{2l}x
\end{equation}
\begin{multline}
C_n = \frac2l\int_0^l(x^2 - 1)\cos\frac{\pi(2n + 1)}{2l}xdx =
\frac4{\pi(2n + 1)}\int_0^l(x^2 - 1)d\sin\frac{\pi(2n + 1)}{2l} = \\
= \frac4{\pi(2n + 1)}\left((x^2 - 1)\sin\frac{\pi(2n + 1)}{2l}\bigg|_0^l -
\int_0^l\sin\frac{\pi(2n + 1)}{2l}2xdx\right) = \\
= \frac1{\pi^2}(2n + 1)^2\int_0^lxd\cos\frac{\pi(2n + 1)}2x =
\frac{16}{\pi^2}\left(x\cos\frac{\pi(2n + 1)}{2l}\bigg|_0^l - \ldots\right)
\end{multline}
Откуда
\begin{equation}
u(x, t) = \sum_{n = 1}^{\infty}\frac{(-1)^n\cdot32}{\pi^3(2n + 1)^3}\exp\left\{-\left(\frac{\pi(2n + 1)}{2l}\right)^2\right\}
\cos\frac{\pi(2n + 1)}{2l}x
\end{equation}
\subsection{Задача 3.6}
\label{sec:orgd1bf1d4}
\begin{equation}
\begin{cases}
u_t = u_{xx}, 0 < x < l, t > 0, \\
u_x(0, t) = 1, \\
u(l, t) = 0, \\
u(x, 0) = 0.
\end{cases}
\end{equation}
Ищем решение в виде $u(x, t) = U(x, t) + V(x, t)$, где $V(x, t) = A(t)x + B(t)$.
Подставив в краевые условия, получим:
\begin{equation}
\begin{cases}
A(t) = 1, \\
l + B(t) = 0,
\end{cases}
\end{equation}
т. е. $V = x - l$.

Для $V(x, t)$ получаем однородную задачу:
\begin{equation}
\begin{cases}
V_t = V_{xx}, \\
V_x(0, t) = V(l, t) = 0, \\
V(x, 0) = l - x.
\end{cases}
\end{equation}
Собственные значения и собственные функции ЗШЛ:
\begin{equation}
\begin{cases}
\lambda_n = \left(\frac{\pi(2n + 1)}{2l}\right)^2, \\
X_n = \cos\frac{\pi(2n + 1)}{2l}.
\end{cases}
\end{equation}
Тогда $V$ ищем в виде $V = \sum_{n = 0}^{\infty}C_ne^{-\lambda_nt}\cos\frac{\pi(2n + 1)}{2l}x$, где
\begin{multline}
C_n = \frac2l\int_0^l(l - x)\cos\frac{\pi(2n + 1)}{2l}xdx =
\frac4{\pi(2n + 1)}\int_0^l(l - x)d\sin\frac{\pi(2n + 1)}{2l}x = \\
= \frac4{\pi(2n + 1)}\left((l - x)\sin\frac{\pi(2n + 1)}{2l}x\bigg|_0^l +
\int_0^l\sin\frac{\pi(2n + 1)}{2l}xdx\right) = \\
= -\frac{8l}{\pi^2(4n + 1)^2}\cos\frac{\pi(2n + 1)}{2l}x\bigg|_0^l = \frac{2l}{\pi^2(2n + 1)^2}
\end{multline}
Откуда
\begin{equation}
u = x - l + \sum_{n = 0}^{\infty}\frac{8l}{\pi^2(2n + 1)^2}\exp\left\{-\left(\frac{\pi(2n + 1)}{2l}\right)^2t\right\}
\cos\frac{\pi(2n + 1)}{2l}x
\end{equation}
\subsection{Задача 3.8}
\label{sec:org3b2b70e}
\begin{equation}
\begin{cases}
u_t = a^2u_{xx}, 0 < x < \pi, t > 0, \\
u_x(0, t) = u(\pi, t) = 0, t > 0, \\
u(x, 0) = \cos\left(\frac{3x}2\right), 0 \leq x \leq \pi.
\end{cases}
\end{equation}
Собственные значения и собственные функции:
\begin{equation}
\begin{cases}
\lambda_n = \left(\frac{2n + 1}{2}\right)^2, \\
X_n = \cos\frac{2n + 1}2x.
\end{cases}
\end{equation}
Ищем общее решение в виде
\begin{equation}
u = \sum_{n = 0}^{\infty}C_ne^{-\lambda_na^2t}\cos\frac{2n + 1}2x.
\end{equation}
$C_n$ находим с помощью разложения в ряд Фурье:
\begin{equation}
u(x, 0) = \sum_{n = 0}^{\infty}C_n\cos\frac{2n + 1}2x = \cos\frac{3x}2 \Rightarrow
C_1 = 1, C_n = 0, n \neq 1.
\end{equation}
Получаем, что $u(x ,t) = e^{-\frac94}a^2t\cos\frac{3x}2$.
\subsection{Задача next}
\label{sec:org1256c3b}
\begin{equation}
\begin{cases}
u_t = \frac19u_{xx} + 1, \\
u(0, t) = t, u_x(1, t) = 0, \\
u(x, 0) = 2\sin\frac32\pi x.
\end{cases}
\end{equation}
Ищем решение в виде $u = U + V$, где $U = A(t)x + B(t)$. Подставляя в граничные условия, получим:
\begin{equation}
B = t, \\
A = 0.
\end{equation}
Для $V$ получаем задачу:
\begin{equation}
\begin{cases}
v_t = \frac19v_{xx}, \\
v(0, t) = v_x(1, t) = 0, \\
v(x, 0) = 2\sin\frac32\pi x.
\end{cases}
\end{equation}
Собственные значения и собственные функции ЗШЛ:
\begin{equation}
\lambda_n = \left(\frac{\pi(2n + 1)}2\right)^2, \\
X_n = \sin\frac{\pi(2n + 1)}2x
\end{equation}
Ищем решение в виде
\begin{equation}
v(x, t) = \sum_{n = 0}^{\infty}C_ne^{-\lambda_n}\frac19t\sin\frac{\pi(2n + 1)}2x.
\end{equation}
Подставляя в начальное условие, получим:
\begin{equation}
v(x, 0) = \sum_{n = 0}^{\infty}C_n\sin\frac{\pi(2n + 1)}2x = 2\sin\frac32x
\end{equation}
Откуда
\begin{equation}
u(x, t) = t + 2\exp\left\{-\frac{\pi^2}4t\right\}\sin\frac32\pi x.
\end{equation}
\subsection{Задача next2}
\label{sec:org985a06b}
\begin{equation}
\begin{cases}
u_t = u_{xx} - u, \\
u(0, t) = u(l, t) = 0, \\
u(x, 0) = 1.
\end{cases}
\end{equation}
Ищем решение в виде $u(x, t) = X(x)T(t)$:
\begin{equation}
XT' = X''T - XT \Rightarrow \frac{X''}X = \frac{T' + T}{T} = -\lambda.
\end{equation}
Получили две задачи:
\begin{equation}
\begin{cases}
X'' + \lambda X = 0, \\
T' + (\lambda + 1)T = 0.
\end{cases}
\end{equation}
Собственные значения и собственные функции ЗШЛ:
\begin{equation}
\lambda_n = \left(\frac{\pi n}l\right)^2, \\
X_n = \sin\frac{\pi n}l.
\end{equation}
Для $T$ получаем:
\begin{equation}
T(t) = Ce^{-(\lambda + 1)t}.
\end{equation}
Тогда общее решение ищется в виде:
\begin{equation}
u = \sum_{n = 1}^{\infty}C_ne^{-(\lambda + 1)t}\sin\frac{\pi n}lx
\end{equation}
Подставляя в начальное условие, находим $C_n$:
\begin{equation}
C_n = \frac2l\int_0^l\sin\frac{\pi n}lxdx = \frac2{\pi n}\cos\frac{\pi n}lx\bigg|_0^l = \frac2{\pi n}(1 - (-1)^n).
\end{equation}
Откуда для $u$:
\begin{equation}
u = \sum_{n = 1}^{\infty}\frac2{\pi n}(1 - (-1)^n)\exp\left\{-\left(\left(\frac{\pi n}l\right)^2 1\right)t\right\}\sin\frac{\pi n}lx
\end{equation}
\subsection{Задача 3.14}
\label{sec:orge2cf4e8}
\begin{equation}
\begin{cases}
u_t = a^2u_{xx}, 0 < x < l, \\
u_x(0, t) = 0, u_x(l, t) + hu(l, t) = 0, h > 0, \\
u(x, 0) = \varphi(x).
\end{cases}
\end{equation}
Ищем решение в виде $u(x, t) = X(x)T(t)$:
\begin{equation}
XT' = a^2X''T \Rightarrow \frac{X''}X = \frac{T'}{a^2T} = -\lambda
\end{equation}
Получили задачи:
\begin{equation}
\begin{cases}
X'' + \lambda X = 0, \\
T' + a^2\lambda T = 0.
\end{cases}
\end{equation}
Решаем ЗШЛ:
1. $\lambda > 0 \Rightarrow X = C_1\cos\sqrt{\lambda}x + C_2\sin\sqrt{\lambda}x$.
Из граничных условий $C_2 = 0$ и $\tg\sqrt{\lambda}l = \frac{h}{\sqrt{\lambda}}$.
Собственными значениями будут решения последнего уравнения, а собственными функциями -
функции $X_n = \cos\sqrt{\lambda_n}x$
Тогда общее решение имеет вид:
\begin{equation}
u(x, t) = \sum_{n = 0}^{\infty}C_ne^{-\lambda_na^2t}\cos\sqrt{\lambda_n}x
\end{equation}
\begin{equation}
\varphi(x) = \sum_{n = 0}^{\infty}C_n\cos\sqrt{\lambda_n}x \Rightarrow C_n = \frac1{|X_n|^2}\int_0^l\varphi(\xi)\cos\sqrt{\lambda_n}\xi d\xi,
\end{equation}
где
\begin{equation}
|X_n|^2 = \int_0^l\cos^2\sqrt{\lambda_n}xdx
\end{equation}
