MatPhys/matphys_sem1.org
** Задача 3.15
 #+BEGIN_EXPORT latex
 \begin{equation}
 \begin{cases}
 u_t = a^2u_{xx}, 0 < x < l, \\
 u_x(0, t) - hu(0, t) = 0, h > 0, \\
 u(l, t) = 0, \\
 u(x, 0) = \varphi(x).
 \end{cases}
 \end{equation}
 Ищем решение в виде $u = X(x)T(t)$, получаем уравнения:
 \begin{equation}
 \begin{cases}
 X'' + \lambda X = 0, X(l) = X'(0) - hX(0) = 0, \\
 T' + \lambda T = 0.
 \end{cases}
 \end{equation}
 В случае $\lambda > 0$:
 \begin{equation}
 X = C_1\cos\sqrt{\lambda}x + C_2\sin\sqrt{\lambda}x
 \end{equation}
 При подстановке граничных условий:
 \begin{equation}
 \begin{cases}
 C_2\sqrt{\lambda} - hC_1 = 0, \\
 C_1\cos\sqrt{\lambda}l + C_2\sin\sqrt{\lambda}l = 0.
 \end{cases}
 \end{equation}
 Откуда $\tg\sqrt{\lambda}l = -\frac{\sqrt{\lambda}}h$. $\lambda_n$ будут решениями этого
 уравнения, а собственные функции будут иметь вид: $X_n = \cos\sqrt{\lambda}x + \frac{h}{\sqrt{\lambda}}\sin\sqrt{\lambda}x$
 #+END_EXPORT

 Д. з. 3.7, 9, 10, 11, 12
* Семинар 4
ДЗ: 4.4, 4.6, 4.7, 4.8, 4.11
** Задача 4.5
#+BEGIN_EXPORT latex
\begin{equation}
\begin{cases}
u_t = a^2u_{xx} + f_0, 0 < x < l, t > 0, f_0 = \text{const}, \\
u(0, t) = u_x(l, t) = 0, t > 0, \\
u(x, 0) = 0, 0 \leq x \leq l.
\end{cases}
\end{equation}
Собственные значения и собственные функции соответствующей ЗШЛ:
\begin{equation}
\begin{cases}
\lambda_n = \left(\frac{\pi(2n + 1)}{2l}\right)^2, \\
X_n = \sin\frac{\pi(2n + 1)}{2l}x
\end{cases}
\end{equation}
Ищем решение в виде
\begin{equation}
u(x, t) = \sum_{n = 0}u_n(t)\sin\sqrt{\lambda_n}x.
\end{equation}
\begin{equation}
f_n = \frac2l\int_0^lf_0\sin\frac{\pi(2n + 1)}{2l}xdx = -\frac{4f_0}{\pi(2n + 1)}\cos\frac{\pi(2n + 1)}{2l}x\bigg|_0^l =
\frac{4f_0}{\pi(2n + 1)}
\end{equation}
Получаем набор задач:
\begin{equation}
\begin{cases}
u_n' = -a^2\lambda_nu_n + f_n, \\
u_n(0) = 0.
\end{cases}
\end{equation}
Решением этой задачи Коши будет функция
\begin{equation}
u_n = \frac{f_n}{a^2\lambda_n}(1 - e^{-a^2\lambda_nt}).
\end{equation}
Тогда решение будет иметь вид:
\begin{equation}
u(x, t) \sum_{n = 0}^{\infty}\frac{16f_0l^2}{\pi^3(2n + 1)^3a^2}\left(1 - \exp\left\{-\left(\frac{\pi(2n + 1)a}{2l}\right)^2\right\}\right)\sin\frac{\pi(2n + 1)}{2l}x
\end{equation}
#+END_EXPORT
** Задача 4.9
#+BEGIN_EXPORT latex
\begin{equation}
\begin{cases}
u_t = u_{xx} + 2, 0 < x < \frac{\pi}2, t > 0, \\
u(0, t) = 2t, u_x\left(\frac{\pi}2, t\right) = 0, t > 0, \\
u(x, 0) = \sin5x, 0 \leq x \leq \frac{\pi}2
\end{cases}
\end{equation}
Ищем решение в виде $u = U + v$, где $U = a(t)x + b(t)$. Подставляя в граничные условия, найдём,
что $a(t) = 0, b(t) = 2t$. Для $v$ получим задачу
\begin{equation}
\begin{cases}
v_t = v_{xx}, \\
v(0, t) = v_x\left(\frac{\pi}2, t\right) = 0, \\
v(x, 0) = \sin5x.
\end{cases}
\end{equation}
Собственные задачи и собственные функции соответствующей ЗШЛ:
\begin{equation}
\begin{cases}
\lambda_n = (2n + 1)^2, \\
X_n = \sin(2n + 1)x.
\end{cases}
\end{equation}
Ищем решение в виде $v = \sum_{n = 0}^{\infty}C_ne^{-a^2\lambda_nt}\sin(2n + 1)x$. Получим, что
$C_2 = 1, C_n = 0, n \neq 2$, откуда
\begin{equation}
u(x, t) = 2t + e^{-25t}\sin5x.
\end{equation}
#+END_EXPORT
** Задача 4.10
Решить задачу
#+BEGIN_EXPORT latex
\begin{equation}
\begin{cases}
u_t = u_{xx} + 2 + 2\sin5x, \\
u(0, t) = 2t, u_x\left(\frac{\pi}2, t\right) = 0, \\
u(x, 0) = 0, 0 \leq x \leq \frac{\pi}2
\end{cases}
\end{equation}
Собственные значения и собственные функции те же, задача после редукции примет вид:
\begin{equation}
\begin{cases}
v_t = v_{xx} + 2\sin5x, \\
v(0, t) = v_x(\frac{\pi}2, t) = 0, \\
v(x, 0) = 0.
\end{cases}
\end{equation}
Ищем решение в виде
\begin{equation}
v = \sum_{n = 0}^{\infty}v_n(t)\sin(2n + 1)x.
\end{equation}
Получим систему
\begin{equation}
\begin{cases}
v_n'(t) = -\lambda_nv_n + f_n, \\
v_n(0) = 0.
\end{cases}
\end{equation}
$f_2 = 2, f_n = 0, n \neq 2 \Rightarrow v_n = 0, n \neq 2$. При $n = 2$:
\begin{equation}
\begin{cases}
v_2' = -25v_2 + 2, \\
v_2(0) = 0.
\end{cases}
\end{equation}
Откуда $v_2 = -\frac2{25}e^{-25t} + \frac2{25}$. Решение имеет вид:
\begin{equation}
u = 2t + \left(\frac2{25}e^{-25t} + \frac2{25}\right)\sin5x
\end{equation}
#+END_EXPORT
** Задача next
#+BEGIN_EXPORT latex
\begin{equation}
\begin{cases}
u_t = a^2u_{xx}, 0 < x < l, t > 0, \\
u(0, t) = At, t > 0 \\
u(l, t) = 0, t > 0 \\
u(x, 0) = 0, 0 \leq x \leq l.
\end{cases}
\end{equation}
Ищем решение в виде $u = U + v$, где $U = a(t)x + b(t)$. Подставляя в граничные условия, находим:
\begin{equation}
\begin{cases}
a(t)l + At = 0, \\
b(t) = At,
\end{cases}
\Rightarrow
\begin{cases}
a(t) = -\frac{A}lt, \\
b(t) = At.
\end{cases}
\end{equation}
Тогда $u = v + \frac{l - x}lAt$. После редукции задача приобретёт вид:
\begin{equation}
\begin{cases}
v_t = a^2v_{xx} - \frac{A(l - x)}l, \\
v(0, t) = v(l, t) = 0, \\
v(x, 0) = 0.
\end{cases}
\end{equation}
Собственные значения и собственные функции ЗШЛ:
\begin{equation}
\begin{cases}
\lambda_n = \left(\frac{\pi n}l\right)^2, \\
X_n = \sin\frac{\pi n}lx
\end{cases}
\end{equation}
Найдём $f_n$:
\begin{equation}
f_n = \frac2l\int_0^l\frac{A}l(x - l)\sin\frac{\pi n}lxdx = \ldots = -\frac{2A}{\pi n}.
\end{equation}
Ищем решение в виде
\begin{equation}
v(x, t) = \sum_{n = 0}^{\infty}v_n(t)\sin\frac{\pi n}lx
\end{equation}
Из этого получим систему:
\begin{equation}
\begin{cases}
v_n' = -a^2\lambda_nv_n + f_n, \\
v_n(0) = 0.
\end{cases}
\end{equation}
Решением этой задачи Коши будет функция $v_n = \frac{f_n}{a^2\lambda_n}(1 - e^{-a^2\lambda_nt})$.
Решение задачи (117) будет иметь в таком случае вид:
\begin{equation}
u(x, t) = -\frac{At}l(x - l) + \sum_{n = 1}^{\infty}-\frac{2Al^2}{\pi^3n^3d^2}\left(1 - \exp\left\{-a^2\ldots\right\}\right)\sin
\end{equation}
#+END_EXPORT
** Задача next2
Решить задачу
#+BEGIN_EXPORT latex
\begin{equation}
\begin{cases}
u_t = u_{xx} + u + 2\sin2x\sin x, 0 < x < \frac{\pi}2, t > 0, \\
u_x(0, t) = u\left(\frac{\pi}2, t\right) = 0, \\
u(x, 0) = 0
\end{cases}
\end{equation}
$$2\sin2x\sin x = \cos x - \cos3x$$
Ищем решение в виде
\begin{equation}
u(x, t) = \sum_{n = 0}^{\infty}u_n(t)\cos(2n + 1)x,
\end{equation}
$$f_0 = 1, f_1 = -1, f_n = 0, n \notin \{0, 1\}$$
Получим систему
\begin{equation}
\begin{cases}
u'_n = -a^2\lambda_nu_n + u_n + f_n, \\
u_n(0) = 0.
\end{cases}
\end{equation}
При $n > 1 u_n = 0$.

$n = 0$:
\begin{equation}
\begin{cases}
u'_0 = -u_0 + u_0 + 1, \\
u_0(0) = 0
\end{cases} \Rightarrow u_0 = t.
\end{equation}
$n = 1$:
\begin{equation}
\begin{cases}
u'_1 = -9u_1 + u_1 - 1, \\
u_1(0) = 0
\end{cases} \Rightarrow u_1 = -\frac18e^{-8t} - \frac18.
\end{equation}
Тогда решение задачи (125) имеет вид
\begin{equation}
u(x, t) = t\cos x + \left(\frac18e^{-8t} - \frac18\right)\cos3x.
\end{equation}
#+END_EXPORT
* Семинар 5
** Задача 4.13
#+BEGIN_EXPORT latex
\begin{equation}
\begin{cases}
u_t = u_{xx} + u, 0 < x < 1, t > 0, \\
u(0, t) = 0, u(l, t) = t, t > 0, \\
u(x, 0) = 0, 0 \leq x \leq 1
\end{cases}
\end{equation}
#+END_EXPORT
*** Решение
#+BEGIN_EXPORT latex
Ищем решение в виде $u = U + v$. $U = a(t)x + b(t)$. Подставляя в начальные условия, получим:
\begin{equation}
a(t) = t, b(t) = 0.
\end{equation}
Получаем, что $u = tx + v$. Получаем задачу на $v$:
\begin{equation}
\begin{cases}
v_t + x = v_{xx} + v + tx, \\
v(0, t) = v(l, t) = 0, \\
v(x, 0) = 0.
\end{cases}
\end{equation}
Ищем решение в виде $v = e^{bt}z$. Тогда:
\begin{equation}
be^{bt}z + e^{bt}z_t = e^{bt}z_{xx} + e^{bt}z + x(t - 1)
\end{equation}
Положим $b = 1$. Тогда
\begin{equation}
\begin{cases}
z_t = z_{xx} + x(t - 1)e^{-t}, \\
z(0, t) = z(l, t) = 0, \\
z(x, 0) = 0.
\end{cases}
\end{equation}
Собственные значения и собственные функции соответствующей ЗШЛ:
\begin{equation}
\begin{cases}
\lambda_n = (\pi n)^2, \\
X_n = \sin\pi nx.
\end{cases}
\end{equation}
Ищем решение в виде
\begin{equation}
z = \sum_{n = 1}^{\infty}z_n\sin\pi nx.
\end{equation}
Разложим источник в ряд Фурье:
\begin{equation}
f_n = 2(t - 1)e^{-t}\int_0^1\xi\sin n\xid\xi = \ldots = 2(t - 1)e^{-t}\frac{(-1)^{n + 1}}{\pi n}.
\end{equation}
Получаем систему задач Коши на $z_n$:
\begin{equation}
\begin{cases}
z_n' = -(\pi n)^2z_n + 2(t - 1)e^{-t}\frac{(-1)^{n + 1}}{\pi n}, \\
z_n(0) = 0.
\end{cases}
\end{equation}
Ищем решение в виде $z_n = C(t)e^{-\pi^2n^2t}$. Тогда:
\begin{equation}
C' = 2(t - 1)\exp\{t(\pi^2n^2 - 1)\}
\end{equation}
\begin{equation}
C = \frac{2(-1)^{n + 1}}{\pi n}\int_0^t(\tau - 1)e^{(\pi n^2 - 1)\tau}d\tau = \ldots =
\frac{2(-1)^{n + 1}}{\pi n((\pi n)^2 - 1)}\left[e^{(\pi n)^2 - 1}\left(t - 1 - \frac1{\pi^2n^2 - 1}\right)\right]
= B_n(t)
\end{equation}
Тогда
\begin{equation}
u(x, t) = tx + e^t\left(\sum_{n = 1}^{\infty}B_n(t)e^{-\pi^2n^2t}\sin\pi nx\right)
\end{equation}
#+END_EXPORT
** Задача 4.15
#+BEGIN_EXPORT latex
\begin{equation}
\begin{cases}
u_t = u_{xx} - u, 0 < x < 1, t > 0 \\
u(0, t) = 0, u_x(1, t) = t, t > 0, \\
u(x, 0) = 0, 0 \leq x \leq 1.
\end{cases}
\end{equation}
#+END_EXPORT
